BEGIN;
USE logistic;

INSERT INTO location (id, title, city, address)
VALUES
    (1, '台北物流中心', '台北', '台北市中正區100號'),
    (2, '台中物流中心', '台中', '台中市南區文心南路100號'),
    (3, '高雄物流中心', '高雄', '高雄市三民區花田一路10號'),
    (4, '花蓮物流中心', '花蓮', '花蓮縣光復鄉中正路100號');


INSERT INTO recipient (id, name, address, phone)
VALUES
    (1, '賴小賴', '台北市中正區100號', "0988000001"),
    (2, '陳大天', '台中市南區文心南路100號', "0988000002"),
    (3, '陳阿扁', '高雄市三民區花田一路10號', "0988000003"),
    (4, '馬小九', '花蓮縣光復鄉中正路100號', "0988000004");


INSERT INTO product (id, name)
VALUES
    (1, '衣服'),
    (2, '褲子'),
    (3, '帽子'),
    (4, '裙子'),
    (5, '鞋子');

COMMIT;